{
  "basic_info": {
    "description_header": "Olá",
    "description": "👋 Sou estudante de Ciência da Computação, autodidata e fluente em inglês, com experiência prática em Inteligência Artificial e desenvolvimento de software. Minha jornada acadêmica, combinada com minha curiosidade, me levou a explorar independentemente várias tecnologias, sempre buscando aprender e aplicar novas ferramentas que podem impactar positivamente o mundo ao nosso redor. Tenho habilidades sólidas em desenvolvimento de software e conhecimento avançado em técnicas de IA, como Machine learning, Processamento de Linguagem Natural (PLN) e Visão Computacional. Me mantenho atualizado com as últimas tendências tecnológicas pois acredito que a inovação e o aprendizado contínuo são essenciais para o sucesso na área de TI. Estou sempre em busca de aplicar e expandir minhas habilidades, colaborar com uma equipe inovadora e contribuir para a criação de soluções que gerem um impacto real.",
    "section_name": {
      "about": "Sobre mim",
      "projects": "Projetos",
      "skills": "habilidades",
      "experience": "Experiências"
    }
  },
  "projects": [
    {
      "title": "Portfólio Pessoal",
      "startDate": "2022",
      "description": "Este é o meu portfólio pessoal, onde apresento alguns dos projetos em que trabalhei e as habilidades que desenvolvi ao longo da minha jornada como estudante de Ciência da Computação. Aqui, você encontrará uma variedade de projetos que demonstram meu conhecimento em desenvolvimento de software, inteligência artificial e outras áreas relacionadas à tecnologia.",
      "images": [
        "images/portfolio/NLP/pln.png"
      ],
      "url": "https://github.com/dataskeptic/relatorioPIBIC/tree/main",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python",
          "isImage": false
        },
        {
          "class": "devicon-scikitlearn-plain",
          "name": "Scikit Learn",
          "isImage": false
        },
        {
          "class": "devicon-pandas-plain",
          "name": "Pandas",
          "isImage": false
        }
      ]
    },
    {
      "title": "RAG app - Atas da UFPI",
      "startDate": "2025",
      "description": "Site desenvolvido com Streamlit! Este é um MVP (Produto Mínimo Viável) de uma aplicação RAG (Geração Aumentada por Recuperação) que utiliza Langchain para criar um sistema de perguntas e respostas baseado nas atas de reunião da Universidade Federal do Piauí (UFPI). A aplicação permite que os usuários façam perguntas relacionadas ao conteúdo das atas e recebam respostas relevantes com base nas informações contidas nos documentos.",
      "images": [
        "images/portfolio/Jaguaracambe/RAG.png"
      ],
      "url": "https://github.com/dataskeptic/talk-with-docs",
      "technologies": [
        {
          "name": "Langchain",
          "isImage": true,
          "path": "images/langchain-icon.png"
        },
        {
          "class": "devicon-python-plain",
          "name": "Python",
          "isImage": false
        },
        {
          "class": "devicon-streamlit-plain",
          "name": "HTML",
          "isImage": false
        },
        {
          "path": "images/nlp.png",
          "name": "'",
          "isImage": true
        }
      ]
    },
    {
      "title": "Detector de Vagas de Estacionamento",
      "startDate": "2024",
      "description": "O projeto combina técnicas de processamento de imagem digital para construir um detector de vagas de estacionamento sem usar técnicas de aprendizado profundo, focando no desenvolvimento de uma aplicação mais leve.",
      "images": [
        "images/portfolio/parking/parking.png"
      ],
      "url": "https://github.com/dataskeptic/Parking-spot-detector",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python",
          "isImage": false
        },
        {
          "class": "devicon-opencv-plain",
          "name": "OpenCV",
          "isImage": false
        },
        {
          "class": "devicon-numpy-plain",
          "name": "Numpy",
          "isImage": false
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "Governo do Estado do Piauí",
      "title": "Estagiário de Tecnologia",
      "years": "01.2025 - atualmente",
      "mainTech": [
        "Python",
        "React"
      ],
      "technologies": [
        "Rest API",
        "React",
        "JavaScript",
        "SQL",
        "Scrum"
      ]
    }
  ]
}