{
  "basic_info": {
    "description_header": "Olá",
    "description": "👋 Sou estudante de Ciência da Computação, autodidata e fluente em inglês, com experiência prática em Inteligência Artificial e desenvolvimento de software. Minha jornada acadêmica, combinada com minha curiosidade, me levou a explorar independentemente várias tecnologias, sempre buscando aprender e aplicar novas ferramentas que podem impactar positivamente o mundo ao nosso redor. Tenho habilidades sólidas em desenvolvimento de software e conhecimento avançado em técnicas de IA, como Machine learning, Processamento de Linguagem Natural (PLN) e Visão Computacional. Me mantenho atualizado com as últimas tendências tecnológicas pois acredito que a inovação e o aprendizado contínuo são essenciais para o sucesso na área de TI. Estou sempre em busca de aplicar e expandir minhas habilidades, colaborar com uma equipe inovadora e contribuir para a criação de soluções que gerem um impacto real.",
    "section_name": {
      "about": "Sobre mim",
      "projects": "Projetos",
      "skills": "habilidades",
      "experience": "Experiências"
    }
  },
  "projects": [
    {
      "title": "Similaridade de Texto - PLN",
      "startDate": "2022",
      "description": "Projeto sobre correção automática para questões discursivas. O projeto envolveu a análise de trabalhos relacionados e a implementação de diferentes técnicas de medidas de similaridade. Comparei o desempenho de diversas métricas de similaridade (como Cosine Similarity, Jaccard Index e Word Mover's Distance) utilizando diferentes modelos de representação vetorial, incluindo Bag of Words, TF-IDF e word embeddings.",
      "images": [
        "images/portfolio/NLP/pln.png"
      ],
      "url": "https://github.com/dataskeptic/relatorioPIBIC/tree/main",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python",
          "isImage": false
        },
        {
          "class": "devicon-scikitlearn-plain",
          "name": "Scikit Learn",
          "isImage": false
        },
        {
          "class": "devicon-pandas-plain",
          "name": "Pandas",
          "isImage": false
        }
      ]
    },
    {
      "title": "RAG app - Atas da UFPI",
      "startDate": "2025",
      "description": "Site desenvolvido com Streamlit! Este é um MVP (Produto Mínimo Viável) de uma aplicação RAG (Geração Aumentada por Recuperação) que utiliza Langchain para criar um sistema de perguntas e respostas baseado nas atas de reunião da Universidade Federal do Piauí (UFPI). A aplicação permite que os usuários façam perguntas relacionadas ao conteúdo das atas e recebam respostas relevantes com base nas informações contidas nos documentos.",
      "images": [
        "images/portfolio/Jaguaracambe/RAG.png"
      ],
      "url": "https://github.com/dataskeptic/talk-with-docs",
      "technologies": [
        {
          "name": "Langchain",
          "isImage": true,
          "path": "images/langchain-icon.png"
        },
        {
          "class": "devicon-python-plain",
          "name": "Python",
          "isImage": false
        },
        {
          "class": "devicon-streamlit-plain",
          "name": "HTML",
          "isImage": false
        },
        {
          "path": "images/nlp.png",
          "name": "'",
          "isImage": true
        }
      ]
    },
    {
      "title": "Detector de Vagas de Estacionamento",
      "startDate": "2024",
      "description": "O projeto combina técnicas de processamento de imagem digital para construir um detector de vagas de estacionamento sem usar técnicas de aprendizado profundo, focando no desenvolvimento de uma aplicação mais leve.",
      "images": [
        "images/portfolio/parking/parking.png"
      ],
      "url": "https://github.com/dataskeptic/Parking-spot-detector",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python",
          "isImage": false
        },
        {
          "class": "devicon-opencv-plain",
          "name": "OpenCV",
          "isImage": false
        },
        {
          "class": "devicon-numpy-plain",
          "name": "Numpy",
          "isImage": false
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "MedSafe",
      "title": "Estagiário de Tecnologia",
      "years": "01.2025 - atualmente",
      "mainTech": [
        "Python",
        "React"
      ],
      "technologies": [
        "Python",
        "Pandas",
        "Angular",
        "TypeScript",
        "LLMs"
      ],
      "description": "Como Estagiário de Tecnologia, atuei no desenvolvimento de software front-end usando Angular no sistema do Piauí Primeira Infância. Também trabalhei com limpeza e tratamento de dados utilizando Python e Pandas."
    },
    {
      "company": "Jaguaracambé",
      "title": "Desenvolvedor",
      "years": "10.2023 - present",
      "mainTech": [
        "Nexjs 8/9/10"
      ],
      "technologies": [
        "Javascript",
        "Nexjs",
        "html",
        "css",
        "React"
      ],
      "description": "Participei da criação do site da Jaguaracambé, uma ONG voltada para a preservação de animais selvagens, uma iniciativa que admiro profundamente. Contribuí para o desenvolvimento do site e atuei também em projetos de educação ambiental que a organização coordena. Você pode acessar o site aqui: https://www.jaguaracambe.org."
    },
    {
      "company": "Universidade Federal do Piauí - UFPI",
      "title": "Iniciação Científica - Bolsista de Pesquisa Universidade Federal do Piauí (UFPI)",
      "years": "07.2022 - 06.2023",
      "mainTech": [
        "Python"
      ],
      "technologies": [
        "Python",
        "Scikit Learn",
        "Pandas",
        "SpaCy",
        "NLTK",
        "Gensim"
      ],
      "description": "Conduzi uma pesquisa sobre correção automática para questões discursivas. O projeto envolveu a análise de trabalhos relacionados e a implementação de diferentes técnicas de medidas de similaridade. Comparei o desempenho de diversas métricas de similaridade (como Cosine Similarity, Jaccard Index e Word Mover's Distance) utilizando diferentes modelos de representação vetorial, incluindo Bag of Words, TF-IDF e word embeddings."
    },
    {
      "company": "Universidade Federal do Piauí - UFPI",
      "title": "Monitor de Estrutura de Dados ",
      "years": "08.2022 - 11.2022",
      "mainTech": [
        "Java"
      ],
      "technologies": [
        "Java"
      ],
      "description": "Corrigi provas e trabalhos, além de fornecer feedback para os alunos. Também ofereci suporte individualizado, ajudando-os a entender e implementar estruturas de dados e algoritmos. Alguns dos tópicos abordados incluíam: listas encadeadas, pilhas, filas, árvores e grafos, tabelas hash, heaps, análise de tempo e espaço de execução e design de algoritmos."
    }
  ]
}